#### Terraform Plan - development

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=curated-knot-develop/sqladmin.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=curated-knot-develop/iam.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=curated-knot-develop/secretmanager.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=curated-knot-develop/iamcredentials.googleapis.com]
google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=curated-knot-develop/vpcaccess.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=curated-knot-develop/run.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=curated-knot-develop/artifactregistry.googleapis.com]
google_project_service.apis["cloudbuild.googleapis.com"]: Refreshing state... [id=curated-knot-develop/cloudbuild.googleapis.com]
google_artifact_registry_repository.images: Refreshing state... [id=projects/curated-knot-develop/locations/asia-south1/repositories/curated-knot-images]
module.networking.google_compute_router.router[0]: Refreshing state... [id=projects/curated-knot-develop/regions/asia-south1/routers/curated-knot-router]
module.networking.google_vpc_access_connector.connector: Refreshing state... [id=projects/curated-knot-develop/locations/asia-south1/connectors/vpc-connector]
module.api_service_account.google_service_account.account: Refreshing state... [id=projects/curated-knot-develop/serviceAccounts/curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.networking.google_compute_address.nat_ip[0]: Refreshing state... [id=projects/curated-knot-develop/regions/asia-south1/addresses/curated-knot-nat-ip]
module.static_assets.google_storage_bucket.bucket: Refreshing state... [id=curated-knot-dev-static-assets]
module.cloud_sql.google_sql_database_instance.main: Refreshing state... [id=curated-knot-db]
module.api_service_account.google_project_iam_member.roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=curated-knot-develop/roles/secretmanager.secretAccessor/serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.api_service_account.google_project_iam_member.roles["roles/logging.logWriter"]: Refreshing state... [id=curated-knot-develop/roles/logging.logWriter/serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.api_service_account.google_project_iam_member.roles["roles/monitoring.metricWriter"]: Refreshing state... [id=curated-knot-develop/roles/monitoring.metricWriter/serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.api_service_account.google_project_iam_member.roles["roles/cloudtrace.agent"]: Refreshing state... [id=curated-knot-develop/roles/cloudtrace.agent/serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.api_service_account.google_project_iam_member.roles["roles/cloudsql.client"]: Refreshing state... [id=curated-knot-develop/roles/cloudsql.client/serviceAccount:curated-knot-api@curated-knot-develop.iam.gserviceaccount.com]
module.networking.google_compute_router_nat.nat[0]: Refreshing state... [id=curated-knot-develop/asia-south1/curated-knot-router/curated-knot-nat]
module.cloud_run_api.google_cloud_run_v2_service.api: Refreshing state... [id=projects/curated-knot-develop/locations/asia-south1/services/curated-knot-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cloud_run_api.google_cloud_run_service_iam_member.public will be created
  + resource "google_cloud_run_service_iam_member" "public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-south1"
      + member   = "allUsers"
      + project  = "curated-knot-develop"
      + role     = "roles/run.invoker"
      + service  = "curated-knot-api"
    }

  # module.cloud_run_api.google_cloud_run_v2_service.api is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "api" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-02-02T06:19:06.635198Z"
              - message              = "Image 'asia-south1-docker.pkg.dev/curated-knot-develop/curated-knot-images/curated-knot-api:develop' not found."
              - reason               = "REVISION_FAILED"
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-02-02T06:19:01.613369Z"
              - message              = "Image 'asia-south1-docker.pkg.dev/curated-knot-develop/curated-knot-images/curated-knot-api:develop' not found."
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "ConfigurationsReady"
            },
        ] -> (known after apply)
      ~ create_time             = "2026-02-02T06:19:01.164586Z" -> (known after apply)
      ~ creator                 = "github-actions-dev@curated-knot-develop.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ effective_labels        = {} -> (known after apply)
      ~ etag                    = "\"CNWDgcwGEJDEvU4/cHJvamVjdHMvY3VyYXRlZC1rbm90LWRldmVsb3AvbG9jYXRpb25zL2FzaWEtc291dGgxL3NlcnZpY2VzL2N1cmF0ZWQta25vdC1hcGk\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/curated-knot-develop/locations/asia-south1/services/curated-knot-api" -> (known after apply)
      - labels                  = {} -> null
      ~ last_modifier           = "github-actions-dev@curated-knot-develop.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/curated-knot-develop/locations/asia-south1/services/curated-knot-api/revisions/curated-knot-api-00001-vqk" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "curated-knot-api"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2026-02-02T06:19:06.635198Z"
              - message              = "Image 'asia-south1-docker.pkg.dev/curated-knot-develop/curated-knot-images/curated-knot-api:develop' not found."
              - reason               = "REVISION_FAILED"
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
            },
        ] -> (known after apply)
      ~ terraform_labels        = {} -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "9bfe195b-9a0d-46de-b1de-923942625f54" -> (known after apply)
      ~ update_time             = "2026-02-02T06:19:01.164586Z" -> (known after apply)
      + uri                     = (known after apply)
        # (3 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - labels                           = {} -> null
          - session_affinity                 = false -> null
            # (3 unchanged attributes hidden)

          ~ containers {
              - args       = [] -> null
              - command    = [] -> null
              - depends_on = [] -> null
              ~ image      = "asia-south1-docker.pkg.dev/curated-knot-develop/curated-knot-images/curated-knot-api:develop" -> "gcr.io/cloudrun/hello"

                # (11 unchanged blocks hidden)
            }

            # (3 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + cloud_run_url                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Triggered by: @abhinavjain-tck, Action: `pull_request`*

> Comment `/apply` to apply this plan.